OpenNuvoton/M55M1BSP/Library/StdDriver/src/lpspi.c
/**************************************************************************//**
 * @file     lpspi.c
 * @version  V1.00
 * @brief    LPSPI driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup LPSPI_Driver LPSPI Driver
  @{
*/

/** @addtogroup LPSPI_EXPORTED_FUNCTIONS LPSPI Exported Functions
  @{
*/
static void LPSPI_SetPCLKSrc(const LPSPI_T *lpspi)
{
    /* Select PCLK as the clock source of LPSPI */
    if (lpspi == LPSPI0)
    {
        CLK->LPSPISEL = (CLK->LPSPISEL & (~CLK_LPSPISEL_LPSPI0SEL_Msk)) | CLK_LPSPISEL_LPSPI0SEL_PCLK4;
    }
}

/**
 * @brief Select PCLK as the clock source of LPSPI
 *
 * @return Actual frequency of LPSPI peripheral clock source.
 */
static uint32_t LPSPI_GetPCLKSrcFreq(const LPSPI_T *lpspi)
{
    uint32_t u32RetValue = 0;

    /* Select PCLK as the clock source of LPSPI */
    if (lpspi == LPSPI0)
    {
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK4Freq();
    }

    return u32RetValue;
}

/**
 * @brief Get LPSPI Clock Source Frequency.
 *
 * @param lpspi     The pointer of the specified LPSPI module.
 * @return uint32_t Clock Frequency
 */
static uint32_t LPSPI_GetModuleClkSrcFreq(const LPSPI_T *lpspi)
{
    uint32_t u32LPSPIClkSrcSel = 0UL;
    uint32_t u32RetValue = 0UL;

    /* Get LPSPI clock source selection */
    if (lpspi == LPSPI0)
    {
        u32LPSPIClkSrcSel = ((CLK->LPSPISEL & CLK_LPSPISEL_LPSPI0SEL_Msk) >> CLK_LPSPISEL_LPSPI0SEL_Pos);
    }
    else
    {
        u32LPSPIClkSrcSel = LPSPI_CLKSEL_PCLK;
    }

    switch (u32LPSPIClkSrcSel)
    {
        case LPSPI_CLKSEL_PCLK:
            u32RetValue = LPSPI_GetPCLKSrcFreq(lpspi);      /* Clock source is PCLK4 */
            break;

        case LPSPI_CLKSEL_MIRC:
            u32RetValue = __MIRC;                           /* Clock source is MIRC */
            break;

        case LPSPI_CLKSEL_HIRC:
            u32RetValue = __HIRC;                           /* Clock source is HIRC */
            break;

        default:
            u32RetValue = LPSPI_GetPCLKSrcFreq(lpspi);      /* Clock source is PCLK4 */
            break;
    }

    return u32RetValue;
}

/**
  * @brief  This function make LPSPI module be ready to transfer.
  * @param[in]  lpspi The pointer of the specified LPSPI module.
  * @param[in]  u32MasterSlave Decides the LPSPI module is operating in master mode or in slave mode. (LPSPI_SLAVE, LPSPI_MASTER)
  * @param[in]  u32LPSPIMode Decides the transfer timing. (LPSPI_MODE_0, LPSPI_MODE_1, LPSPI_MODE_2, LPSPI_MODE_3)
  * @param[in]  u32DataWidth Decides the data width of a LPSPI transaction.
  * @param[in]  u32BusClock The expected frequency of LPSPI bus clock in Hz.
  * @return Actual frequency of LPSPI peripheral clock.
  * @details By default, the LPSPI transfer sequence is MSB first, the slave selection signal is active low and the automatic
  *          slave selection function is disabled.
  *          In Slave mode, the u32BusClock shall be NULL and the LPSPI clock divider setting will be 0.
  *          The actual clock rate may be different from the target LPSPI clock rate.
  *          For example, if the LPSPI source clock rate is 12 MHz and the target LPSPI bus clock rate is 7 MHz, the
  *          actual LPSPI clock rate will be 6MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, LPSPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= LPSPI peripheral clock source, DIVIDER will be set to 0.
  * @note   In slave mode, the LPSPI peripheral clock rate will be equal to APB clock rate.
  */
uint32_t LPSPI_Open(LPSPI_T *lpspi, uint32_t u32MasterSlave, uint32_t u32LPSPIMode, uint32_t u32DataWidth, uint32_t u32BusClock)
{
    uint32_t u32RetValue = 0UL;
    uint32_t u32DataWidthTmp = 0UL;

    if ((u32DataWidth < 4U) && (u32DataWidth > 0U))
    {
        u32DataWidthTmp = 4U;
    }
    else if (u32DataWidth >= 32U)
    {
        u32DataWidthTmp = 0U;
    }
    else
    {
        u32DataWidthTmp = u32DataWidth;
    }

    if (u32MasterSlave == LPSPI_MASTER)
    {
        /* Default setting: slave selection signal is active low; disable automatic slave selection function. */
        lpspi->SSCTL = LPSPI_SS_ACTIVE_LOW;

        /* Default setting: MSB first, disable unit transfer interrupt, SP_CYCLE = 0. */
        lpspi->CTL = (u32MasterSlave);
        lpspi->CTL |= ((u32DataWidthTmp << LPSPI_CTL_DWIDTH_Pos) |
                       (u32LPSPIMode) |
                       LPSPI_CTL_SPIEN_Msk);

        // Set the bus clock for the LPSPI module and store the actual frequency in u32RetValue
        u32RetValue = LPSPI_SetBusClock(lpspi, u32BusClock);
    }
    else     /* For slave mode, force the LPSPI peripheral clock rate to equal APB clock rate. */
    {
        /* Default setting: slave selection signal is low level active. */
        lpspi->SSCTL = LPSPI_SS_ACTIVE_LOW;

        /* Default setting: MSB first, disable unit transfer interrupt, SP_CYCLE = 0. */
        lpspi->CTL = (u32MasterSlave);
        lpspi->CTL |= ((u32DataWidthTmp << LPSPI_CTL_DWIDTH_Pos) |
                       (u32LPSPIMode) |
                       LPSPI_CTL_SPIEN_Msk);

        /* Set DIVIDER = 0 */
        lpspi->CLKDIV = 0U;

        /* Select PCLK4 as the clock source of LPSPI */
        u32RetValue = LPSPI_GetPCLKSrcFreq(lpspi);
    }

    return u32RetValue;
}

/**
  * @brief  Disable LPSPI controller.
  * @param[in]  lpspi The pointer of the specified LPSPI module.
  * @details This function will reset LPSPI controller.
  */
void LPSPI_Close(const LPSPI_T *lpspi)
{
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (u32RegLockLevel)
    {
        /* Unlock protected registers */
        SYS_UnlockReg();
    }

